Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--cesium_quickstart.tmx
Source language: en
Languages: ja

source: Cesium Quickstart
ja: Cesiumクイックスタート

source: Cesium is a JavaScript library for creating 3D globes and 2D maps in a web browser without any plugins. It uses WebGL for hardware-accelerated graphics, and is cross-platform, cross-browser, and tuned for time-dynamic data visualization.
ja: Cesiumは、プラグインなしでウェブブラウザで3D地球儀と2Dマップを作成するためのJavaScriptライブラリです。OSGeoLiveは、ハードウェアアクセラレーションによるグラフィックス処理にWebGLを使用し、クロスプラットフォーム、クロスブラウザ対応で、時間動的なデータ視覚化に合わせて調整されています。

source: This guide shows how to use the Cesium with the 3D (Globe), 2.5D (Columbus View) and 2D (map).
ja: このガイドでは、Cesiumを3D(地球儀)、2.5D(コロンブスビュー)、2D(マップ)で使用する方法について説明します。

source: Start Cesium
ja: Cesiumの開始

source: Open the browser and point it to http://localhost/cesium/Apps/HelloWorld.html
ja: ブラウザを開き、http://localhost/cesium/Apps/HelloWorld.htmlを開く

source: Search for a location
ja: 場所を検索

source: Click on the magnifying glass and type in the location you are looking for. In the following display, we look for India.
ja: 虫眼鏡をクリックして、探している位置を入力します。次の表示では、インドを探します。

source: Switch between 3D, 2.5D and 2D
ja: 3D、2.5D、2Dの切り替え

source: Click on the wire framed globe icon to select your preferred view. Here the 2.5D Columbus view has been selected.
ja: ワイヤーで囲まれたビューアイコンをクリックして、希望の地球儀を選択します。ここでは、2.5D Columbusビューが選択されています。

source: Now the 2D map is selected.
ja: これで、2Dマップが選択されました。

source: Select the Image layer
ja: 画像のレイヤを選択

source: Click on the last icon and select a type of image service. Here the Natural Earth II is selected and you can see how the map's image layer has changed.
ja: 最後のアイコンをクリックして、イメージサービスの種類を選択します。ここでNatural Earth IIが選択され、マップのイメージレイヤがどのように変化したかを見ることができます。

source: What next?
ja: 次のステップ

source: Watch our `video tutorials <https://www.youtube.com/playlist?list=PLBk_Dtk-_Tlm4STvXKFEdfUWylPemo-9V>`_.
ja: `ビデオチュートリアル<https://www.youtube.com/playlist?list=PLBk_Dtk - _Tlm4STvXKFEdfUWylPemo-9V>`_をご覧ください。

source: Read our written `tutorials <https://cesium.com/docs>`_.
ja: `チュートリアル<https://cesium.com/docs>`_をお読みください。

source: You can develop some quick applications using the `Sandcastle website <https://sandcastle.cesium.com/index.html>`_. Sandcastle is generally one of the best ways to learn about Cesium, and all the code examples are useful for this purpose.
ja: `Sandcastle Webサイト<https://sandcastle.cesium.com/index.html>`_を使用して、いくつかのクイックアプリケーションを開発できます。Sandcastleは一般的にCesiumについて学ぶ最良の方法の1つであり、すべてのコード例がこの目的に役立ちます。

source: The `Cesium Forum <https://groups.google.com/forum/#!forum/cesium-dev>`_ is a great place to search for answers to common questions, and to raise questions that haven't been asked before.
ja: `Cesium Forum<https://groups.google.com/forum/#!forum/cesium-dev>`_は、一般的な質問に対する回答を検索したり、これまでに質問されたことのない質問を提起したりするのに最適な場所です。

source: In-depth documentation is available `locally <http://localhost/cesium/>`_ on the OSGeoLive package.
ja: 詳細なドキュメントは、OSGeoLiveパッケージの`locally<http://localhost/cesium/>`_で入手できます。
